000000*> .................................................................... <*
000000*> CBL - IF-ELSE                           :      Maximum Tension       <*
000000*> ........................................:........................... <*
000000*>                                         :     -__            __-     <*
000000*> Teoman Deniz                            : :    :!1!-_    _-!1!:    : <*
000000*> maximum-tension.com                     : ::                      :: <*
000000*>                                         : :!:    : :: : :  :  ::::!: <*
000000*> ....................................... :  :!:: :!:!1:!:!::1:::!!!:  <*
000000*> : C - Maximum Tension :: C 2024/02/03 : :  ::!::!!1001010!:!11!!::   <*
000000*> :.....................::..............: :  :!1!!11000000000011!!:    <*
000000*> : License - NON       :: U 2024/02/16 : :   ::::!!!1!!1!!!1!!!::     <*
000000*> :.....................::..............: :      ::::!::!:::!::::      <*
000000*> ........................................:........................... <*
000000*> IF VAR =  - EQUAL
000000*> IF VAR <> - NOT EQUAL
000000*> IF VAR <  - LESS
000000*> IF VAR >  - GREAHER
000000*> IF VAR => - EQUAL OR GREATHER
000000*> IF VAR =< - EQUAL OR LESS
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLE-IF-ELSE.
000300 DATA DIVISION.
000401 WORKING-STORAGE SECTION.
000502 77 VAR_NUMBER PIC 99.
000600 PROCEDURE DIVISION.
000700 0001-MAIN.
000801 MOVE 10 TO VAR_NUMBER.
000901*> ........................... [v] EQUAL [v] .......................... <*
001001 IF VAR_NUMBER = 10
001102 DISPLAY 'VAR_NUMBER IS 10.'
001201 END-IF.
001301*> ........................... [^] EQUAL [^] .......................... <*
001401*> ......................... [v] NOT EQUAL [v] ........................ <*
001501 IF VAR_NUMBER <> 10
001602 DISPLAY 'VAR_NUMBER IS NOT 10.'
001701 END-IF.
001801*> ......................... [^] NOT EQUAL [^] ........................ <*
001901*> ........................... [v] ELSE [v] ........................... <*
002001 IF VAR_NUMBER > 5
002102 DISPLAY 'VAR_NUMBER IS GREATER THAN 5.'
002201 ELSE
002302 DISPLAY 'VAR_NUMBER IS NOT GREATER THAN 5.'
002401 END-IF.
002501*> ........................... [^] ELSE [^] ........................... <*
002601 STOP RUN.
