IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE-IF-ELSE.
DATA DIVISION.
	WORKING-STORAGE SECTION.
		77 EAX PIC 99.

PROCEDURE DIVISION.
0001-MAIN.
	MOVE 10 TO EAX.

	IF EAX = 10
		DISPLAY 'EAX IS 10.'
	END-IF.

	IF EAX <> 10
		DISPLAY 'EAX IS NOT 10.'
	END-IF.

	IF EAX > 5
		DISPLAY 'EAX IS GREATER THAN 5.'
	ELSE
		DISPLAY 'EAX IS NOT GREATER THAN 5.'
	END-IF.

STOP RUN.

*> =  - EQUAL
*> <> - NOT EQUAL
*> <  - LESS
*> >  - GREAHER
*> => - EQUAL OR GREATHER
*> =< - EQUAL OR LESS