000000*> .................................................................... <*
000000*> CBL - IO                                :      Maximum Tension       <*
000000*> ........................................:........................... <*
000000*>                                         :     -__            __-     <*
000000*> Teoman Deniz                            : :    :!1!-_    _-!1!:    : <*
000000*> maximum-tension.com                     : ::                      :: <*
000000*>                                         : :!:    : :: : :  :  ::::!: <*
000000*> ....................................... :  :!:: :!:!1:!:!::1:::!!!:  <*
000000*> : C - Maximum Tension :: C 2024/02/03 : :  ::!::!!1001010!:!11!!::   <*
000000*> :.....................::..............: :  :!1!!11000000000011!!:    <*
000000*> : License - NON       :: U 2024/02/16 : :   ::::!!!1!!1!!!1!!!::     <*
000000*> :.....................::..............: :      ::::!::!:::!::::      <*
000000*> ........................................:........................... <*
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLE-INPUT.
000300 DATA DIVISION.
000401 WORKING-STORAGE SECTION.
000502 77 NAME    PIC X(20).
000602 77 SURNAME PIC X(20).
000702 77 AGE     PIC 99.
000800 PROCEDURE DIVISION.
000900 0001-MAIN.
001001*> ......................... [v] STRING 1 [v] ......................... <*
001101 DISPLAY 'ENTER YOUR NAME: '.
001201 ACCEPT NAME.
001301*> ......................... [^] STRING 1 [^] ......................... <*
001401*> ......................... [v] STRING 2 [v] ......................... <*
001501 DISPLAY 'ENTER YOUR SURNAME: '.
001601 ACCEPT SURNAME.
001701*> ......................... [^] STRING 2 [^] ......................... <*
001801*> .......................... [v] NUMBER [v] .......................... <*
001901 DISPLAY 'ENTER YOUR AGE: '.
002001 ACCEPT AGE.
002101*> .......................... [^] NUMBER [^] .......................... <*
002201 DISPLAY 'NAME: ' NAME.
002301 DISPLAY 'SURNAME: ' SURNAME.
002401 DISPLAY 'AGE: ' AGE.
002501 STOP RUN.
