000000 *> ................................................................... <*
000000 *> CBL - IO                               :      Maximum Tension       <*
000000 *> .......................................:........................... <*
000000 *>                                        :     -__            __-     <*
000000 *> Teoman Deniz                           : :    :!1!-_    _-!1!:    : <*
000000 *> maximum-tension.com                    : ::                      :: <*
000000 *>                                        : :!:    : :: : :  :  ::::!: <*
000000 *> ...................................... :  :!:: :!:!1:!:!::1:::!!!:  <*
000000 *> : C - Maximum Tension : C 2024/02/03 : :  ::!::!!1001010!:!11!!::   <*
000000 *> :.....................:..............: :  :!1!!11000000000011!!:    <*
000000 *> : License - NON       : U 2024/02/06 : :   ::::!!!1!!1!!!1!!!::     <*
000000 *> :.....................:..............: :      ::::!::!:::!::::      <*
000000 *> .......................................:........................... <*
000100	IDENTIFICATION DIVISION.
000200	PROGRAM-ID. EXAMPLE-INPUT.
000300	DATA DIVISION.
000400		WORKING-STORAGE SECTION.
000500			77 NAME PIC X(20).
000600			77 SURNAME PIC X(20).
000700			77 AGE PIC 99.
000800	PROCEDURE DIVISION.
000900	0001-MAIN.
001000		*> ...................... [v] STRING 1 [v] ...................... <*
001100		DISPLAY 'ENTER YOUR NAME: '.
001200		ACCEPT NAME.
001300		*> ...................... [^] STRING 1 [^] ...................... <*
001400		*> ...................... [v] STRING 2 [v] ...................... <*
001500		DISPLAY 'ENTER YOUR SURNAME: '.
001600		ACCEPT SURNAME.
001700		*> ...................... [^] STRING 2 [^] ...................... <*
001800		*> ....................... [v] NUMBER [v] ....................... <*
001900		DISPLAY 'ENTER YOUR AGE: '.
002000		ACCEPT AGE.
002100		*> ....................... [^] NUMBER [^] ....................... <*
002200		DISPLAY 'NAME: ' NAME.
002300		DISPLAY 'SURNAME: ' SURNAME.
002400		DISPLAY 'AGE: ' AGE.
002500		STOP RUN.
