IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE-LOOP.
DATA DIVISION.
	WORKING-STORAGE SECTION.
		77 ECX PIC 99.
PROCEDURE DIVISION.
0001-MAIN.
	SET ECX TO 0

	PERFORM UNTIL ECX >= 10
		ADD 1 TO ECX
		DISPLAY 'Test - ' ECX
	END-PERFORM.

STOP RUN.
