000000*> .................................................................... <*
000000*> CBL - NUMERIC-VARIABLE                  :      Maximum Tension       <*
000000*> ........................................:........................... <*
000000*>                                         :     -__            __-     <*
000000*> Teoman Deniz                            : :    :!1!-_    _-!1!:    : <*
000000*> maximum-tension.com                     : ::                      :: <*
000000*>                                         : :!:    : :: : :  :  ::::!: <*
000000*> ....................................... :  :!:: :!:!1:!:!::1:::!!!:  <*
000000*> : C - Maximum Tension :: C 2024/02/03 : :  ::!::!!1001010!:!11!!::   <*
000000*> :.....................::..............: :  :!1!!11000000000011!!:    <*
000000*> : License - NON       :: U 2024/02/16 : :   ::::!!!1!!1!!!1!!!::     <*
000000*> :.....................::..............: :      ::::!::!:::!::::      <*
000000*> ........................................:........................... <*
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLE-NUMERIC-VARIABLE.
000300 DATA DIVISION.
000401 WORKING-STORAGE SECTION.
000502 77 NUM1   PIC 99.
000602 77 NUM2   PIC 9(2).
000702 77 RESULT PIC 9(3) VALUE 42.
000800 PROCEDURE DIVISION.
000900 0001-MAIN.
001001*> ....................... [v] SET VARIABLE [v] ....................... <*
001101 SET NUM1 TO 15
001201 MOVE 5 TO NUM2
001301*> ....................... [^] SET VARIABLE [^] ....................... <*
001401*> ......................... [v] COLLECT [v] .......................... <*
001501 ADD NUM1 TO NUM2 GIVING RESULT
001601*>   NUM1  + NUM2   =    RESULT
001701*>     15  +    5   =    20
001801*> ......................... [^] COLLECT [^] .......................... <*
001901*> ......................... [v] SUBTRACT [v] ......................... <*
002001 SUBTRACT NUM1 FROM NUM2 GIVING RESULT
002101*>        NUM1  -   NUM2   =    RESULT
002201*>          15  -      5   =    10
002301*> ......................... [^] SUBTRACT [^] ......................... <*
002401*> ......................... [v] MULTIPLY [v] ......................... <*
002501 MULTIPLY NUM1 BY NUM2 GIVING RESULT
002601*>        NUM1  * NUM2     =  RESULT
002701*>          15  *    5     =  75
002801*> ......................... [^] MULTIPLY [^] ......................... <*
002901*> .......................... [v] DIVIDE [v] .......................... <*
003001 DIVIDE NUM2 INTO NUM1 GIVING RESULT
003101*>      NUM1  /   NUM2   =    RESULT
003201*>            X                       !!! IT'S WORKS OPPOSITE !!!
003301*>        15  /      5   =    3
003401*> .......................... [^] DIVIDE [^] .......................... <*
003501*> ........................... [v] POW [v] ............................ <*
003601 COMPUTE RESULT = NUM2 ** NUM1.
003701*>       RESULT = NUM2  ^ NUM1
003801*>       759375 = 15^5
003901*> ........................... [^] POW [^] ............................ <*
004001*> ......................... [v] MODULUS [v] .......................... <*
004101 MOVE NUM1 TO RESULT
004201 PERFORM UNTIL RESULT < NUM2
004302 SUBTRACT RESULT FROM NUM2 GIVING RESULT
004401 END-PERFORM.
004501 DISPLAY RESULT *> NUM1 % NUM2 = RESULT
004601*> ......................... [^] MODULUS [^] .......................... <*
004701 STOP RUN.
