000000 *> ................................................................... <*
000000 *> CBL - NUMERIC-VARIABLE                 :      Maximum Tension       <*
000000 *> .......................................:........................... <*
000000 *>                                        :     -__            __-     <*
000000 *> Teoman Deniz                           : :    :!1!-_    _-!1!:    : <*
000000 *> maximum-tension.com                    : ::                      :: <*
000000 *>                                        : :!:    : :: : :  :  ::::!: <*
000000 *> ...................................... :  :!:: :!:!1:!:!::1:::!!!:  <*
000000 *> : C - Maximum Tension : C 2024/02/03 : :  ::!::!!1001010!:!11!!::   <*
000000 *> :.....................:..............: :  :!1!!11000000000011!!:    <*
000000 *> : License - NON       : U 2024/02/06 : :   ::::!!!1!!1!!!1!!!::     <*
000000 *> :.....................:..............: :      ::::!::!:::!::::      <*
000000 *> .......................................:........................... <*
000100	IDENTIFICATION DIVISION.
000200	PROGRAM-ID. EXAMPLE-NUMERIC-VARIABLE.
000300	DATA DIVISION.
000400		WORKING-STORAGE SECTION.
000500			77 NUM1 PIC 99.
000600			77 NUM2 PIC 9(2).
000700			77 RESULT PIC 9(3) VALUE 42.
000800	PROCEDURE DIVISION.
000900	0001-MAIN.
001000		*> .................... [v] SET VARIABLE [v] .................... <*
001100		SET NUM1 TO 15
001200		MOVE 5 TO NUM2
001300		*> .................... [^] SET VARIABLE [^] .................... <*
001400		*> ...................... [v] COLLECT [v] ....................... <*
001500		ADD NUM1 TO NUM2 GIVING RESULT
001600		*>  NUM1  + NUM2   =    RESULT
001700		*>    15  +    5   =    20
001800		*> ...................... [^] COLLECT [^] ....................... <*
001900		*> ...................... [v] SUBTRACT [v] ...................... <*
002000		SUBTRACT NUM1 FROM NUM2 GIVING RESULT
002100		*>       NUM1  -   NUM2   =    RESULT
002200		*>         15  -      5   =    10
002300		*> ...................... [^] SUBTRACT [^] ...................... <*
002400		*> ...................... [v] MULTIPLY [v] ...................... <*
002500		MULTIPLY NUM1 BY NUM2 GIVING RESULT
002600		*>       NUM1  * NUM2     =  RESULT
002700		*>         15  *    5     =  75
002800		*> ...................... [^] MULTIPLY [^] ...................... <*
002900		*> ....................... [v] DIVIDE [v] ....................... <*
003000		DIVIDE NUM2 INTO NUM1 GIVING RESULT
003100		*>     NUM1  /   NUM2   =    RESULT
003200		*>           X                       !!! IT'S WORKS OPPOSITE !!!
003300		*>       15  /      5   =    3
003400		*> ....................... [^] DIVIDE [^] ....................... <*
003500		*> ........................ [v] POW [v] ......................... <*
003600		COMPUTE RESULT = NUM2 ** NUM1.
003700		*>      RESULT = NUM2  ^ NUM1
003800		*>      759375 = 15^5
003900		*> ........................ [^] POW [^] ......................... <*
004000		*> ...................... [v] MODULUS [v] ....................... <*
004100		MOVE NUM1 TO RESULT
004200		PERFORM UNTIL RESULT < NUM2
004300			SUBTRACT RESULT FROM NUM2 GIVING RESULT
004400		END-PERFORM.
004500		DISPLAY RESULT *> NUM1 % NUM2 = RESULT
004600		*> ...................... [^] MODULUS [^] ....................... <*
004700		STOP RUN.
