*> GO TO <- GO TO A PARAGRAPH
*> PERFORM <- CALL A PARAGRAPH
*> EXIT <- EXIT FROM A PARAGRAPH THAT CALLED VIA "PERFROM"
IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE-PARAGRAPHS.

PROCEDURE DIVISION.
0001-MAIN.
	PERFORM TEST-PARAGRAPH. *> CALL PARAGRAPH
	DISPLAY 'CONTINUING PROCESS...'.
	GO TO EXIT-PROGRAM. *> GO TO A PARAGRAPH

TEST-PARAGRAPH. *> (X EAX) <*
	DISPLAY 'HERE WE ARE IN THE PARAGRAPH'.
	EXIT. *> EXIT PARAGRAPH AND CONTINUE TO PARENT PARAGRAPH

EXIT-PROGRAM.
	DISPLAY 'PROGRAM CLOSING...'.
	STOP RUN.